const path = require('path');

module.exports = {
  command: ['غزل'],
  description: 'ترفيه: عبارات غزلية 💗',
  category: 'ترفيه',
  usage: '.غزل',
  group: true,

  async execute(sock, msg) {
    const tips = [
 '*انت بقربي والراء لام فيا ليت الذي في قلبي بقربي ينام',
  'أنت حبري والراء تزال ياليتني اضمك وانسى بأن هذا محال',
  'قلمي انت والميم باء وبعدك عني اصابني بالشقاء',
  'لولاك لكان ليلي شتاء، وانت نجمي الذي يرشدني في العتماء',
  'أنت حلمي الذي لا ينتهي، ووردة في قلبي لا تذبل أبداً',
  'كأنك النور الذي يخترق العتمة في قلبي، فتصبح الحياة أجمل',
  'أنت الفصول الأربعة في قلبي، أنت الربيع والصيف والخريف والشتاء',
  'كأنك الوتر الذي يعزف عليه قلبي لحن الحب بلا توقف',
  'أنت كالقمر الذي يضيء ليلي، كالشمس التي تدفئ نهاري',
  'يا ليت الزمان يطول بلقائك، وأظل محتفظاً ببريق عينيك في ذاكرتي',
  'أنت الروح التي تملأني بالحياة، والقلب الذي ينبض بحبك',
  'يا ليتني كنت نسمة هواء لأحتضنك دون أن تشعري',
  'أنت الأمل الذي يسكن قلبي، والضوء الذي يضيء طريقي',
  'كأنك وردة في بستاني، وعطرك يملأ روحي بالحب',
  'أنت النور الذي ينير ظلامي، والبسمة التي تمحو أحزاني',
  'كأنك القمر في سمائي، يضيء ليلي ويمنحني الأمان',
  'أنت كالنجم الذي يرشدني في ظلام الليل، فلا أخاف من الضياع',
  'أنت الزهرة التي تزين قلبي، وتملأ روحي بالحب والجمال',
  'يا ليتني كنت كتابك المفضل، لتقرأني كل يوم دون ملل',
  'أنت البحر الذي أغرق في أعماقه، فلا أريد النجاة من غرق حبك',
  'كأنك البلسم الذي يشفي جراحي، والنسيم الذي ينعش روحي',
  'أنت الشمس التي تشرق في حياتي، والقمر الذي يضيء ليلي',
  'أنت الحلم الذي يتحقق كل يوم، والواقع الذي أعيشه بكل حب',
  'يا ليتني كنت خيطاً في ثوبك، لأكون قريباً منك دائماً',
  'أنت النسمة التي تهمس في أذني بأجمل الكلمات، وتملأ قلبي بالحب',
  'كأنك النجمة التي تضيء سماء قلبي، وتجعل الليل أجمل',
  'أنت الوردة التي تزين حديقتي، وتملأها بعطر الحب والجمال',
  'أنت القمر الذي يضيء حياتي، ويمنحني الأمل في كل يوم جديد',
  'أنت اللحن الذي يعزف على وتر قلبي، ويجعلني أرقص فرحاً',
  'كأنك الشمس التي تدفئ روحي، والنسيم الذي ينعش حياتي',
  'أنت الحلم الذي لا أريد أن أستيقظ منه أبداً، والحقيقة التي أعيشها بكل حب'
    ];

    const randomTip = tips[Math.floor(Math.random() * tips.length)];

    // فحص المنشن
    const mentioned = msg.message?.extendedTextMessage?.contextInfo?.mentionedJid;

    // الهدف = المنشن إذا موجود، لو ما فيه → صاحب الأمر
    const targetJid = (mentioned && mentioned.length > 0)
      ? mentioned[0]
      : (msg.key?.participant || msg.participant || msg.sender);

    const target = targetJid.split('@')[0];

    const imagePath = path.join(__dirname, '../resources/غزل.jpg');

    const caption = `
━━━━💋 *غزل* 💋━━━━

@${target}
_*${randomTip}🫦🫵🏻*_

━━━ *FOR U* 👉👈━━━
`;

    await sock.sendMessage(msg.key.remoteJid, {
      image: { url: imagePath },
      caption,
      mentions: [targetJid],
    }, { quoted: msg });
  }
};